<a href="https://colab.research.google.com/github/Pepcoders/Business-Analytics-Content/blob/BA/23_feb.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
install.packages("tidyverse")
library(tidyverse)

In [2]:
table1

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [ ]:
table4a

In [6]:
table2

   country     year type       count
1  Afghanistan 1999 cases             745
2  Afghanistan 1999 population   19987071
3  Afghanistan 2000 cases            2666
4  Afghanistan 2000 population   20595360
5  Brazil      1999 cases           37737
6  Brazil      1999 population  172006362
7  Brazil      2000 cases           80488
8  Brazil      2000 population  174504898
9  China       1999 cases          212258
10 China       1999 population 1272915272
11 China       2000 cases          213766
12 China       2000 population 1280428583

In [5]:
table4a %>%     # "then"
pivot_longer(cols = c('1999','2000'),names_to="year",values_to = "cases") %>%    #Unpivot
arrange(country,year)

  country     year cases
1 Afghanistan 1999    745
2 Afghanistan 2000   2666
3 Brazil      1999  37737
4 Brazil      2000  80488
5 China       1999 212258
6 China       2000 213766

In [7]:
table2 %>% 
pivot_wider(names_from ="type",values_from = "count" )

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [8]:
table3

  country     year rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

In [9]:
table3 %>%
separate(rate, into = c("cases","population"),sep="/",convert = TRUE) # convert argument allows to auto-detect the data type of the new columns

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [10]:
table5

  country     century year rate
1 Afghanistan 19      99   745/19987071
2 Afghanistan 20      00   2666/20595360
3 Brazil      19      99   37737/172006362
4 Brazil      20      00   80488/174504898
5 China       19      99   212258/1272915272
6 China       20      00   213766/1280428583

In [11]:
table5 %>%
unite(new,century,year)

  country     new   rate
1 Afghanistan 19_99 745/19987071
2 Afghanistan 20_00 2666/20595360
3 Brazil      19_99 37737/172006362
4 Brazil      20_00 80488/174504898
5 China       19_99 212258/1272915272
6 China       20_00 213766/1280428583

In [15]:
table5 %>%
unite(new,century,year,sep="") %>% # remove argument is for retaining the old columns 
mutate(new = as.integer(new))

  country     new  rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

In [16]:
#Example Data 
stocks <- tibble(
  year=c(2015,2015,2015,2015,2016,2016,2016),
  qtr=c(1,2,3,4,2,3,4),
  yield=c(1.88,0.59,0.35,NA,0.91,0.17,2.66)
)

In [ ]:
stocks

In [ ]:
stocks %>%
fill(yield,.direction = "down" )

In [21]:
stocks %>%
complete(year,qtr)

  year qtr yield
1 2015 1   1.88
2 2015 2   0.59
3 2015 3   0.35
4 2015 4     NA
5 2016 1     NA
6 2016 2   0.91
7 2016 3   0.17
8 2016 4   2.66

In [22]:
stocks %>%
complete(year,qtr) %>%
fill(yield,.direction = "down")

  year qtr yield
1 2015 1   1.88
2 2015 2   0.59
3 2015 3   0.35
4 2015 4   0.35
5 2016 1   0.35
6 2016 2   0.91
7 2016 3   0.17
8 2016 4   2.66

In [23]:
# dplyr
install.packages('nycflights13')
library(nycflights13)

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

In [25]:
flights = flights
airlines<- airlines

In [27]:
colnames(flights)

 [1] "year"           "month"          "day"            "dep_time"
 [5] "sched_dep_time" "dep_delay"      "arr_time"       "sched_arr_time"
 [9] "arr_delay"      "carrier"        "flight"         "tailnum"
[13] "origin"         "dest"           "air_time"       "distance"
[17] "hour"           "minute"         "time_hour"

In [ ]:
flights %>%
dplyr::filter(month==1|month==2,day==1)    # filtering the rows

In [29]:
flightsFiltered = flights %>%
dplyr::filter(month %in% c(11,12))  %>%   # month==11 | month==12
dplyr::filter(dep_time >=700) %>%
dplyr::filter(carrier!="UA")

In [ ]:
#june july flights between 5-10 pm of UA 
flights %>%
dplyr::filter(month %in% c(6,7))  %>%   # month==6 | month==7
dplyr::filter(dep_time >=1700 & dep_time <= 2200) %>%
dplyr::filter(carrier=="UA")

In [33]:
flightsArranged <- flightsFiltered %>%
arrange(year,month,day,desc(dep_delay))

In [38]:
flightsSelected <- flightsArranged %>%
dplyr::select(-(hour:time_hour)) %>%
dplyr::select(-(sched_dep_time),-(sched_arr_time),-(tailnum)) %>%
dplyr::rename("airtime"="air_time","destination"="dest")

In [40]:
flightsMutated <- flightsSelected %>%
mutate(gain=dep_delay-arr_delay,
        hours =airtime/60,
        gain_per_hour=gain/hours)

In [45]:
meanDelays <- flightsMutated %>%
group_by(carrier) %>%
dplyr::summarize(meanDelay=mean(dep_delay,na.rm = TRUE)) %>%
arrange(desc(meanDelay))

In [ ]:
carrierCounts <-flightsMutated %>%
group_by(carrier) %>%
dplyr::summarize(Count=n()) %>%   # n()     #COUNTROWS(table<name>)
arrange(desc(Count))

carrierCounts

In [46]:
meanDelays

   carrier meanDelay
1  FL      21.541667
2  WN      20.295775
3  EV      19.753031
4  9E      13.932293
5  F9      13.338843
6  AS      12.494845
7  YV      11.760870
8  B6      11.207818
9  MQ       8.454451
10 AA       8.246411
11 DL       7.615321
12 VX       6.942045
13 US       3.841341
14 OO       0.800000
15 HA      -4.226415

In [ ]:
airlines

In [ ]:
meanDelays %>%
left_join(airlines,by=c("carrier"="carrier")) %>% # left_join of  'airline','meanDelays'
dplyr::select(name,carrier,meanDelay)

In [ ]:
# which carrier has highest avg gain ?
#